{
  "privacy": {
    "back": "← Back",
    "title": "Privacy Policy",
    "last_updated": "Last updated: February 2026",
    "overview_title": "Overview",
    "overview_text": "General Market is a decentralized protocol for on-chain index products. We collect minimal data and prioritize your privacy.",
    "collect_title": "What We Collect",
    "collect_wallets": "Wallet addresses",
    "collect_wallets_desc": "Public blockchain addresses used for trading",
    "collect_txs": "Transaction data",
    "collect_txs_desc": "On-chain trading activity (publicly visible on the Index L3 chain)",
    "no_collect_title": "What We Don't Collect",
    "no_collect_keys": "Private keys — These never leave your local environment",
    "no_collect_identity": "Personal identity — We don't require KYC or personal information",
    "no_collect_browsing": "Browsing data — We don't use tracking cookies",
    "blockchain_title": "Blockchain Transparency",
    "blockchain_text": "All trading activity occurs on the Index L3 chain, a public blockchain. Your wallet address and transaction history are publicly visible on block explorers. This is inherent to blockchain technology, not a choice we make.",
    "storage_title": "Data Storage",
    "storage_text": "ITP configurations and order data are stored on-chain. Off-chain data (like price feeds and NAV calculations) is processed by authorized issuers and stored temporarily.",
    "third_party_title": "Third Parties",
    "third_party_text": "We interact with CoinGecko for price data and Morpho for lending markets. We don't sell or share your data with advertisers or data brokers.",
    "contact_title": "Contact",
    "contact_text": "Questions? Reach out on X:"
  },
  "terms": {
    "back": "← Back",
    "title": "Terms of Service",
    "last_updated": "Last updated: February 2026",
    "acceptance_title": "Acceptance",
    "acceptance_text": "By using General Market, you agree to these terms. If you don't agree, don't use the platform.",
    "what_is_title": "What General Market Is",
    "what_is_text": "General Market is an institutional-grade protocol for on-chain index products. It runs on the Index L3 chain using smart contracts. You can create, trade, and manage tokenized index tracking products (ITPs).",
    "risk_title": "Risk Warning",
    "risk_bold": "You can lose money.",
    "risk_text": "Trading index products involves significant risk. ITP values fluctuate with underlying asset prices. You could lose some or all of your capital. Only use funds you can afford to lose.",
    "experimental_title": "Experimental Software",
    "experimental_text": "General Market is experimental software. Smart contracts are immutable once deployed—bugs cannot be patched. Use at your own risk. We make no guarantees about security, uptime, or functionality.",
    "responsibilities_title": "Your Responsibilities",
    "responsibilities_keys": "You control your private keys — we can't recover them if lost",
    "responsibilities_decisions": "You're responsible for your trading decisions",
    "responsibilities_laws": "You must comply with laws in your jurisdiction",
    "responsibilities_tax": "You're responsible for tax obligations on any profits",
    "no_advice_title": "No Financial Advice",
    "no_advice_text": "Nothing on General Market is financial advice. We don't recommend specific trades, indices, or strategies.",
    "prohibited_title": "Prohibited Use",
    "prohibited_manipulation": "Market manipulation or wash trading",
    "prohibited_exploits": "Exploiting bugs or vulnerabilities",
    "prohibited_interfere": "Interfering with other users",
    "prohibited_illegal": "Using the platform for illegal activity",
    "liability_title": "Limitation of Liability",
    "liability_text": "General Market is provided \"as is\" without warranties. We're not liable for losses from trading, bugs, hacks, smart contract failures, or any other cause.",
    "changes_title": "Changes",
    "changes_text": "We may update these terms. Continued use after changes means you accept the new terms.",
    "contact_title": "Contact",
    "contact_text": "Questions? Reach out on X:"
  }
}
